# 13: Konversi nilai numerik ke dalam sejumlah kategori

"Enjelita Meilinda - 2373037"
# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    31
1    92
2    28
3    85
4     7
5    20
6    67
7    36
8    90
9     6

# Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [3]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    31        dewasa
1    92        manula
2    28        dewasa
3    85        manula
4     7          anak
5    20        dewasa
6    67        manula
7    36        dewasa
8    90        manula
9     6          anak